package controller
/**************************************************************************************************/
/*!
 *  base.go
 *
 *  どのcontrollerでも呼ばれる基底メソッド系
 *  あまりimportさせたくないものをこちらに書く
 *
 */
/**************************************************************************************************/
import (
	"github.com/gin-gonic/gin"

	db "sample/DBI"
	"sample/common/err"
	"sample/logic"
)

/**************************************************************************************************/
/*!
 *  DB COMMIT
 */
/**************************************************************************************************/
func dbCommit(c *gin.Context) err.ErrWriter {
	ew := db.Commit(c)
	if ew.HasErr() {
		ew.Write()
	}
	return ew
}

/**************************************************************************************************/
/*!
 *  DB ROLLBACK
 */
/**************************************************************************************************/
func dbRollback(c *gin.Context) err.ErrWriter {
	ew := db.RollBack(c)
	if ew.HasErr() {
		ew.Write()
	}
	return ew
}

/**************************************************************************************************/
/*!
 *  Redis Exec
 */
/**************************************************************************************************/
func redisExec(c *gin.Context) err.ErrWriter {
	_, ew := logic.NewRedisRepo().Exec(c)
	if ew.HasErr() {
		ew.Write()
	}
	return ew
}

/**************************************************************************************************/
/*!
 *  Redis discard
 */
/**************************************************************************************************/
func redisDiscard(c *gin.Context) err.ErrWriter {
	ew := logic.NewRedisRepo().Discard(c)
	if ew.HasErr() {
		ew.Write()
	}
	return ew
}